"use strict";
//Массивы
let a5 = []; //Пустой массив - тип any
let b5 = [1, 2, 3];
//b5 = ['']//Ошибка. b5 уже определен как number
let c5;
let d5 = [];
//d5 = ['']//Ошибка. d5 уже определен как number
let e5 = [1, 2, ''];
let f5 = [1, 2, ''];
//Кортежи
let g5 = [1, ''];
//g5 = [1, 2]//Ошибка. Второй элемент должен быть строкой
//g5 = [1]//Ошибка. Должно быть два элемента
let h5 = [1, ''];
h5 = [1];
//h5 = [1, 2]//Ошибка. Второй элемент, если он есть, должен быть строкой
//Перечисления
var Z;
(function (Z) {
    Z[Z["K"] = 5] = "K";
    Z[Z["L"] = 6] = "L";
})(Z || (Z = {}));
console.log(Z.K, Z.L);
var Y;
(function (Y) {
    Y["K"] = "\u0421\u0442\u0440\u043E\u043A\u0430";
    Y["L"] = "\u0415\u0449\u0435 \u0441\u0442\u0440\u043E\u043A\u0430";
})(Y || (Y = {}));
console.log(Y.K, Y.L);
console.log(Z.K, Z.L);
console.log(0 /* X.K */, 1 /* X.L */);
//# sourceMappingURL=script05.js.map